{
  "source": "doc/api/documentation-es.markdown",
  "miscs": [
    {
      "textRaw": "Acerca de esta documentación",
      "name": "Acerca de esta documentación",
      "type": "misc",
      "desc": "<p>El objetivo de este documento es explicar íntegralmente la API Node.js, tanto\ncomo una referencia, como así también un punto de vista conceptual. Cada\nsección describe un módulo integrado (built-in module) o un concepto de alto nivel\n(high-level concept).\n\n</p>\n<p>En su caso, los tipos de propiedades, los argumentos de métodos, y los argumentos\nproporcionados a los controladores de eventos se detallan en una lista debajo\nde la cabecera del topic.\n\n</p>\n<p>Cada documento <code>.html</code> tiene un documento correspondiente <code>.json</code> presentando\nla misma información de una manera estructurada. Esta característica es\nexperimental, y se agrega para el beneficio de las IDEs y otras utilidades que\ndesean hacer cosas programáticas con la documentación.\n\n</p>\n<p>Cada archivo <code>.html</code> y <code>.json</code> es generado en base al correspondiente archivo\n<code>.markdown</code> de la carpeta <code>doc/api</code> en el árbol del código fuente de node. La\ndocumentación es generada utilizando el programa <code>tools/doc/generate.js</code>. La\nplantilla html esta ubicada en <code>doc/template.html</code>.\n\n</p>\n",
      "miscs": [
        {
          "textRaw": "Índice de estabilidad",
          "name": "Índice de estabilidad",
          "type": "misc",
          "desc": "<p>A lo largo de la documentación verá las indicaciones de estabilidad de cada\nsección. La API Node.js es algo cambiante, y a medida que madura, ciertas\npartes son más confiables que otras. Algunas están tan probados, y son tan\nconfiables que es poco probable que cambien en lo absoluto. Otros son completamente\nnuevos y experimentales, o se considera peligroso y en proceso de ser rediseñado.\n\n</p>\n<p>Los avisos se parecen a esto:\n\n</p>\n<pre><code>Stability: 1 Experimental</code></pre>\n<p>Los índices de estabilidad son los siguientes:\n\n</p>\n<ul>\n<li><strong>0 - Deprecated</strong>  Esta característica es conocida como problemática y ya se han \nprevisto cambios. No confíe en esto. El uso de esta característica puede causar\nadvertencias.</li>\n</ul>\n<ul>\n<li><strong>1 - Experimental</strong>  Esta característica se ha incluído recientemente y puede \ncambiar o ser removida en futuras versiones. Por favor, pruébela y de feedback.\nSi esta dirige a un caso de uso importante para usted, hágalo saber al equipo\nprincipal de node.</li>\n</ul>\n<ul>\n<li><strong>2 - Unstable</strong> La API está en proceso de resolución, pero todavia no ha sido \nsuficientemente testeada en el mundo real para ser considerada estable.\nSi es razonable se mantendrá compatiblidad con versiones anteriores.</li>\n</ul>\n<ul>\n<li><strong>3 - Stable</strong>  La API ha resultado satisfactoria pero limpiar en el código \nsubyacente puede causar pequeños cambios. Esta garantizada la  compatibilidad con \nversiones anteriores.</li>\n</ul>\n<ul>\n<li><strong>4 - API Frozen</strong>  La API ha sido testeada ampliamente en producción y es \npoco provable que alguna vez tenga cambios.</li>\n</ul>\n<ul>\n<li><strong>5 - Locked</strong> Al menos que sean encontrados serios bugs este código nunca \ncambiará. Por favor no sugiera cambios en esta parte, serán rechazados.</li>\n</ul>\n"
        },
        {
          "textRaw": "salida JSON",
          "name": "salida_json",
          "stability": 1,
          "stabilityText": "Experimental",
          "desc": "<p>Cada archivo HTML en el markdown tiene un correspondiente archivo JSON con los\nmismos datos.\n\n</p>\n<p>Esta característica se agregó a partir de node v0.6.12. Es experimental.\n</p>\n",
          "type": "misc",
          "displayName": "salida JSON"
        }
      ]
    }
  ]
}
